RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_romapi_e907.c
__ALWAYS_INLINE ATTR_TCM_SECTION
void HBN_Mode_Enter(HBN_APP_CFG_Type *cfg){
    return RomDriver_HBN_Mode_Enter(cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void HBN_Power_Down_Flash(SPI_Flash_Cfg_Type *flashCfg){
    return RomDriver_HBN_Power_Down_Flash(flashCfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_DCache_Clean_All(void){
    return RomDriver_L1C_DCache_Clean_All();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_DCache_Clean_By_Addr(uintptr_t addr, uint32_t len){
    return RomDriver_L1C_DCache_Clean_By_Addr(addr,len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_DCache_Clean_Invalid_All(void){
    return RomDriver_L1C_DCache_Clean_Invalid_All();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_DCache_Clean_Invalid_By_Addr(uintptr_t addr, uint32_t len){
    return RomDriver_L1C_DCache_Clean_Invalid_By_Addr(addr,len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_DCache_Disable(void){
    return RomDriver_L1C_DCache_Disable();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_DCache_Enable(uint8_t wayDsiable){
    return RomDriver_L1C_DCache_Enable(wayDsiable);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_DCache_Invalid_All(void){
    return RomDriver_L1C_DCache_Invalid_All();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_DCache_Invalid_By_Addr(uintptr_t addr, uint32_t len){
    return RomDriver_L1C_DCache_Invalid_By_Addr(addr,len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_ICache_Disable(void){
    return RomDriver_L1C_ICache_Disable();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_ICache_Enable(uint8_t wayDsiable){
    return RomDriver_L1C_ICache_Enable(wayDsiable);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_ICache_Invalid_All(void){
    return RomDriver_L1C_ICache_Invalid_All();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_ICache_Invalid_By_Addr(uintptr_t addr, uint32_t len){
    return RomDriver_L1C_ICache_Invalid_By_Addr(addr,len);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_Set_Cache_Setting_By_ID(uint8_t core, L1C_CACHE_Cfg_Type *cacheSetting){
    return RomDriver_L1C_Set_Cache_Setting_By_ID(core,cacheSetting);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type L1C_Set_Wrap(uint8_t en){
    return RomDriver_L1C_Set_Wrap(en);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int L1C_Get_None_Cache_Addr(uintptr_t addr){
    return RomDriver_L1C_Get_None_Cache_Addr(addr);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
int L1C_Is_DCache_Range(uintptr_t addr){
    return RomDriver_L1C_Is_DCache_Range(addr);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
void L1C_DCache_Write_Set(BL_Fun_Type wtEn, BL_Fun_Type wbEn, BL_Fun_Type waEn){
    return RomDriver_L1C_DCache_Write_Set(wtEn,wbEn,waEn);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Default_Level_Config(PDS_DEFAULT_LV_CFG_Type *defaultLvCfg, PDS_CTRL_RAM1_Type *ram1Cfg, PDS_CTRL_RAM2_Type *ram2Cfg, uint32_t pdsSleepCnt){
    return RomDriver_PDS_Default_Level_Config(defaultLvCfg,ram1Cfg,ram2Cfg,pdsSleepCnt);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Enable(PDS_CTL_Type *cfg, PDS_CTL4_Type *cfg4, uint32_t pdsSleepCnt){
    return RomDriver_PDS_Enable(cfg,cfg4,pdsSleepCnt);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Force_Config(PDS_CTL2_Type *cfg2, PDS_CTL3_Type *cfg3, PDS_CTL5_Type *cfg5){
    return RomDriver_PDS_Force_Config(cfg2,cfg3,cfg5);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_IntClear(void){
    return RomDriver_PDS_IntClear();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_IntMask(PDS_INT_Type intType, BL_Mask_Type intMask){
    return RomDriver_PDS_IntMask(intType,intMask);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Power_On_MM_System(void){
    return RomDriver_PDS_Power_On_MM_System();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_RAM_Config(PDS_CTRL_RAM1_Type *ram1Cfg, PDS_CTRL_RAM2_Type *ram2Cfg){
    return RomDriver_PDS_RAM_Config(ram1Cfg,ram2Cfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Reset_LP_RTC(void){
    return RomDriver_PDS_Reset_LP_RTC();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Set_Flash_Pad_Pull_None(SF_Ctrl_Pin_Select pinCfg){
    return RomDriver_PDS_Set_Flash_Pad_Pull_None(pinCfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Set_Flash_Pad_Pull_None_Fast(SF_Ctrl_Pin_Select pinCfg){
    return RomDriver_PDS_Set_Flash_Pad_Pull_None_Fast(pinCfg);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Set_GPIO_Pad_IntClr(PDS_GPIO_INT_SET_Type set){
    return RomDriver_PDS_Set_GPIO_Pad_IntClr(set);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Set_GPIO_Pad_IntMask(GLB_GPIO_Type pad, BL_Mask_Type intMask){
    return RomDriver_PDS_Set_GPIO_Pad_IntMask(pad,intMask);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Set_GPIO_Pad_IntMode(PDS_GPIO_INT_SET_Type set, PDS_GPIO_INT_TRIG_Type trig){
    return RomDriver_PDS_Set_GPIO_Pad_IntMode(set,trig);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Set_GPIO_Pad_Pn_Pu_Pd_Ie(GLB_GPIO_Type pad, uint8_t pu, uint8_t pd, uint8_t ie){
    return RomDriver_PDS_Set_GPIO_Pad_Pn_Pu_Pd_Ie(pad,pu,pd,ie);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Set_LP_Clock_Disable(void){
    return RomDriver_PDS_Set_LP_Clock_Disable();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Set_LP_Clock_Enable(void){
    return RomDriver_PDS_Set_LP_Clock_Enable();
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Set_LP_RTC_CLK(uint8_t enable, uint16_t div){
    return RomDriver_PDS_Set_LP_RTC_CLK(enable,div);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Set_LP_Reset_Address(uint32_t addr){
    return RomDriver_PDS_Set_LP_Reset_Address(addr);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Set_LP_System_CLK(PDS_LP_SYS_CLK_Type clkFreq){
    return RomDriver_PDS_Set_LP_System_CLK(clkFreq);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Set_LP_System_CLK_Div(uint8_t div){
    return RomDriver_PDS_Set_LP_System_CLK_Div(div);
}

__ALWAYS_INLINE ATTR_TCM_SECTION
BL_Err_Type PDS_Set_MCU0_Clock_Disable(void){
    return RomDriver_PDS_Set_MCU0_Clock_Disable();
}

